{
  "backend/main.mo": "Actor providing user-profile storage with access control, authorization mixins, and profile CRUD restricted by permissions.",
  "backend/migration.mo": "Defines legacy-to-new migration types and returns an empty new actor state.",
  "feature_evidence.json": "Feature evidence report listing proposal-related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/BUILD_NOTES.md": "Build notes describing architecture, deterministic logic, storage, sync behavior, admin tools, and accessibility guidelines.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color variables, light/dark themes, and base styling.",
  "frontend/index.html": "Main HTML entrypoint setting metadata and loading the React app.",
  "frontend/REDESIGN_PROPOSAL.md": "Full proposal outlining a from-scratch deterministic redesign of Onebit with expanded UX, wellness support, and removal of demo mode.",
  "frontend/src/App.tsx": "Root React component managing app flow, session state, accessibility settings, and dialogs including Quick Add and admin settings.",
  "frontend/src/components/AccessibilityControls.tsx": "Provides a floating popover with toggles for high contrast and large font settings, loading and saving preferences via a11y settings store.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin dialog for editing demo content, sync settings, daily anchors, and microstep categories, with persistence and II-based sync control.",
  "frontend/src/components/ApiKeyDialog.tsx": "Empty file with no implemented content.",
  "frontend/src/components/QuickAddDialog.tsx": "Modal for quickly adding text items with keyboard shortcuts and submit handling.",
  "frontend/src/components/ReflectionPromptDialog.tsx": "Dialog prompting end-of-day reflections, saving or skipping entries through the reflections store.",
  "frontend/src/demo/demoFlows.ts": "Defines preset demo flow configurations representing sample session inputs.",
  "frontend/src/demo/demoSessions.ts": "Provides predefined demo session history objects with outcomes and metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCountdownTimer.ts": "Custom countdown timer hook with start, pause, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth provider and hook, handling login, stored identities, and related status states.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global Tailwind setup defining design tokens, themes, and accessibility modes like dark mode and large-font mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/ActionModePage.tsx": "Timer-driven action page where users start working, add a quick note, and check in when done.",
  "frontend/src/pages/CheckInPage.tsx": "Simple page letting users choose an outcome of their session such as done, stuck, or avoided.",
  "frontend/src/pages/ContextPage.tsx": "Collects user context by selecting a blocker and a time bucket before proceeding.",
  "frontend/src/pages/FinalizationChecklistPage.tsx": "Editable finalization checklist with persisted settings like logo choice, accent color, and demo inputs.",
  "frontend/src/pages/FocusCompressionPage.tsx": "Processes user input to generate a compressed action, fallback, and rationale before continuing.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays past sessions, demo mode data, habit stats, and reflection prompts, with export and date formatting helpers.",
  "frontend/src/pages/LandingPage.tsx": "Shows the landing screen with pitch text, daily anchor, optional demo video, and buttons to start normal or demo mode.",
  "frontend/src/pages/MentalDumpPage.tsx": "Collects the user's mental dump text, restores drafts, auto-saves updates, and moves to the next step.",
  "frontend/src/pages/RecoveryPage.tsx": "Generates and displays deterministic recovery messages and micro-steps based on session outcome, with actions to retry or start new.",
  "frontend/src/pages/SessionEndPage.tsx": "Saves the completed session to storage, shows a summary of results, and offers navigation to history or a new session.",
  "frontend/src/store/a11ySettings.ts": "Loads, saves, and applies accessibility settings such as high contrast and large font to the document root.",
  "frontend/src/store/adminSettings.ts": "Manages loading and storing the demo video link and pitch text in localStorage.",
  "frontend/src/store/dailyAnchorPhrases.ts": "Loads, stores, and cycles daily anchor phrases, providing one based on the day of year.",
  "frontend/src/store/demoMode.ts": "Tracks demo mode status, loading and saving it to localStorage.",
  "frontend/src/store/finalizationChecklist.ts": "Stores and updates finalization checklist data such as branding, demo inputs, and approvals in localStorage.",
  "frontend/src/store/microStepLibrary.ts": "Manages loading, storing, and updating categorized micro-step templates in localStorage.",
  "frontend/src/store/reflectionsStore.ts": "Handles daily reflections storage, retrieval, and prompt-tracking using localStorage.",
  "frontend/src/store/sessionStore.ts": "Stores drafts and completed sessions, manages mental dump updates, and persists sessions in localStorage.",
  "frontend/src/store/syncSettings.ts": "Loads and toggles a boolean sync-enabled setting backed by localStorage.",
  "frontend/src/sync/sessionSync.ts": "Stub functions for future session syncing; all currently return false or empty arrays.",
  "frontend/src/utils/deterministicDemoInputGenerator.ts": "Provides fixed demo inputs with mental dumps, blockers, and time buckets.",
  "frontend/src/utils/deterministicFocusCompression.ts": "Parses task lists to pick a primary action and fallback based on scoring and time constraints.",
  "frontend/src/utils/deterministicRecovery.ts": "Generates recovery messages and micro-steps based on task category and session outcome.",
  "frontend/src/utils/exportSessionsTxt.ts": "Exports stored sessions into a formatted downloadable .txt file.",
  "frontend/src/utils/habitMemory.ts": "Computes number of unique active days in the last 14 days based on session timestamps.",
  "frontend/src/utils/llmOutputPolicy.ts": "Empty file placeholder for LLM output policy logic.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters across routing and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, utilities, and plugins.",
  "project_state.json": "Holds the project’s versioned state plus a detailed list of existing features with their ids, descriptions, and synonyms. Describes the user’s latest request for a full redesign proposal of Onebit from scratch."
}