{
  "backend/main.mo": "Actor implementing user profiles, admin-restricted API key storage, and per-user session CRUD with authorization checks.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the Onebit app.",
  "frontend/BUILD_NOTES.md": "Build notes explaining deterministic behavior, optional LLM integration, storage model, demo mode, and export utilities.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens, dark mode variants, and base styles.",
  "frontend/index.html": "Base HTML entry point loading the Onebit app root and main TypeScript entry file.",
  "frontend/src/App.tsx": "Main app component managing all flow steps, session state, theme, and initialization of client-side settings.",
  "frontend/src/components/AdminSettingsDialog.tsx": "Admin-only dialog to manage API keys, LLM toggle, and landing page content with local state and store hooks.",
  "frontend/src/components/ApiKeyDialog.tsx": "Simple admin dialog for viewing API key status and saving or clearing the OpenAI API key.",
  "frontend/src/demo/demoSessions.ts": "Provides static demo session data mimicking stored session history.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useCountdownTimer.ts": "Custom countdown timer hook with start, pause, reset, and formatted time output.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for sessions, API keys, admin checks, and AI task generation.",
  "frontend/src/index.css": "Defines Tailwind layers and a full theme with color variables, light/dark modes, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ActionModePage.tsx": "Renders the action focus view with a countdown timer and controls for start, pause, reset, and check-in.",
  "frontend/src/pages/CheckInPage.tsx": "Displays outcome options for a completed session and reports the selected result.",
  "frontend/src/pages/ContextPage.tsx": "Collects the user’s blocker and available time using radio selections before advancing.",
  "frontend/src/pages/FocusCompressionPage.tsx": "Runs deterministic focus compression, shows the chosen action and fallback, and proceeds after user confirmation.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays past sessions with optional demo mode, sync toggle, and text export.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing logo, pitch, optional demo video, and buttons to start, view history, or toggle demo mode.",
  "frontend/src/pages/MentalDumpPage.tsx": "Page for users to enter a list of thoughts and proceed or go back in the workflow.",
  "frontend/src/pages/RecoveryPage.tsx": "Generates and displays deterministic recovery steps based on session outcome, with options to continue or end the session.",
  "frontend/src/pages/SessionEndPage.tsx": "Final page that saves the completed session and offers navigation to view history.",
  "frontend/src/store/adminSettings.ts": "Stores and retrieves admin settings such as LLM enablement, demo video link, and pitch text using localStorage.",
  "frontend/src/store/demoMode.ts": "Handles enabling, disabling, and loading demo mode via localStorage.",
  "frontend/src/store/sessionStore.ts": "Manages session drafts and completed session history in localStorage, keeping up to 50 sessions.",
  "frontend/src/store/syncSettings.ts": "Stores and manages sync enablement state in localStorage.",
  "frontend/src/utils/deterministicFocusCompression.ts": "Compresses user text into a single actionable task using heuristics and time estimates.",
  "frontend/src/utils/deterministicRecovery.ts": "Generates deterministic recovery messages and micro‑steps based on the task and outcome.",
  "frontend/src/utils/exportSessionsTxt.ts": "Builds a formatted text report for all stored sessions and triggers a client-side download as a .txt file.",
  "frontend/src/utils/llmOutputPolicy.ts": "Cleans and validates LLM output by removing disallowed patterns, enforcing one-sentence limits, and rejecting non-actionable text.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive params from hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, container settings, animations, and plugin integrations for the frontend.",
  "project_state.json": "Stores the current project state, feature definitions, and high-level product requirements for the Onebit rebuild."
}